{"format": "keras", "nodes": [{"name": "input_2", "id": "input_2", "class_name": "InputLayer", "output_shape": [[null, 128, 128, 3]], "num_parameters": 0}, {"name": "resnet50v2", "id": "resnet50v2", "class_name": "Functional", "output_shape": [null, 4, 4, 2048], "num_parameters": 23564800}, {"name": "global_average_pooling2d", "id": "global_average_pooling2d", "class_name": "GlobalAveragePooling2D", "output_shape": [null, 2048], "num_parameters": 0}, {"name": "predictions", "id": "predictions", "class_name": "Dense", "output_shape": [null, 38], "num_parameters": 77862}], "edges": [["input_2", "resnet50v2"], ["resnet50v2", "global_average_pooling2d"], ["global_average_pooling2d", "predictions"]]}