{"format": "keras", "nodes": [{"name": "input_9", "id": "input_9", "class_name": "InputLayer", "output_shape": [[null, 128, 128, 3]], "num_parameters": 0}, {"name": "tf.math.truediv_4", "id": "tf.math.truediv_4", "class_name": "TFOpLambda", "output_shape": [null, 128, 128, 3], "num_parameters": 0}, {"name": "efficientnetv2-b3", "id": "efficientnetv2-b3", "class_name": "Functional", "output_shape": [null, 4, 4, 1536], "num_parameters": 12930622}, {"name": "global_average_pooling2d_2", "id": "global_average_pooling2d_2", "class_name": "GlobalAveragePooling2D", "output_shape": [null, 1536], "num_parameters": 0}, {"name": "predictions", "id": "predictions", "class_name": "Dense", "output_shape": [null, 38], "num_parameters": 58406}], "edges": [["tf.math.truediv_4", "efficientnetv2-b3"], ["input_9", "efficientnetv2-b3"], ["efficientnetv2-b3", "global_average_pooling2d_2"], ["efficientnetv2-b3", "global_average_pooling2d_2"], ["global_average_pooling2d_2", "predictions"], ["global_average_pooling2d_2", "predictions"]]}