{"format": "keras", "nodes": [{"name": "input_6", "id": "input_6", "class_name": "InputLayer", "output_shape": [[null, 128, 128, 3]], "num_parameters": 0}, {"name": "tf.math.truediv_2", "id": "tf.math.truediv_2", "class_name": "TFOpLambda", "output_shape": [null, 128, 128, 3], "num_parameters": 0}, {"name": "densenet201", "id": "densenet201", "class_name": "Functional", "output_shape": [null, 4, 4, 1920], "num_parameters": 18321984}, {"name": "global_average_pooling2d_1", "id": "global_average_pooling2d_1", "class_name": "GlobalAveragePooling2D", "output_shape": [null, 1920], "num_parameters": 0}, {"name": "predictions", "id": "predictions", "class_name": "Dense", "output_shape": [null, 38], "num_parameters": 72998}], "edges": [["tf.math.truediv_2", "densenet201"], ["input_6", "densenet201"], ["densenet201", "global_average_pooling2d_1"], ["densenet201", "global_average_pooling2d_1"], ["global_average_pooling2d_1", "predictions"], ["global_average_pooling2d_1", "predictions"]]}