{"format": "keras", "nodes": [{"name": "input_3", "id": "input_3", "class_name": "InputLayer", "output_shape": [[null, 128, 128, 3]], "num_parameters": 0}, {"name": "tf.math.subtract", "id": "tf.math.subtract", "class_name": "TFOpLambda", "output_shape": [null, 128, 128, 3], "num_parameters": 0}, {"name": "inception_resnet_v2", "id": "inception_resnet_v2", "class_name": "Functional", "output_shape": [null, 2, 2, 1536], "num_parameters": 54336736}, {"name": "global_average_pooling2d", "id": "global_average_pooling2d", "class_name": "GlobalAveragePooling2D", "output_shape": [null, 1536], "num_parameters": 0}, {"name": "predictions", "id": "predictions", "class_name": "Dense", "output_shape": [null, 38], "num_parameters": 58406}], "edges": [["tf.math.subtract", "inception_resnet_v2"], ["input_3", "inception_resnet_v2"], ["inception_resnet_v2", "global_average_pooling2d"], ["inception_resnet_v2", "global_average_pooling2d"], ["global_average_pooling2d", "predictions"], ["global_average_pooling2d", "predictions"]]}